//
//  Copyright (C) 2024-2025  Nick Gasson
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

#ifndef _MIR_NODE_H
#define _MIR_NODE_H

#include "prim.h"
#include "diag.h"
#include "util.h"

#include <limits.h>

#define MIR_TAG_NULL    0
#define MIR_TAG_BLOCK   1
#define MIR_TAG_PARAM   2
#define MIR_TAG_NODE    3
#define MIR_TAG_COMMENT 4
#define MIR_TAG_TYPE    5
#define MIR_TAG_CONST   6
#define MIR_TAG_STAMP   7
#define MIR_TAG_VAR     8
#define MIR_TAG_ENUM    9
#define MIR_TAG_LINKAGE 10
#define MIR_TAG_EXTVAR  11

#define _MIR_TAG_BITS   4
#define _MIR_ID_BITS    28

STATIC_ASSERT(_MIR_TAG_BITS + _MIR_ID_BITS == 32);

#define MIR_ID_MAX ((1 << _MIR_ID_BITS) - 1)

typedef union _mir_block {
   struct {
      unsigned tag : _MIR_TAG_BITS;
      unsigned id : _MIR_ID_BITS;
   };
   uint32_t bits;
} mir_block_t;

STATIC_ASSERT(sizeof(mir_block_t) == 4);

#define MIR_NULL_BLOCK ((mir_block_t){ .tag = MIR_TAG_NULL })

typedef union _mir_value {
   struct {
      unsigned tag : _MIR_TAG_BITS;
      unsigned id : _MIR_ID_BITS;
   };
   uint32_t bits;
} mir_value_t;

STATIC_ASSERT(sizeof(mir_value_t) == 4);

#define MIR_NULL_VALUE ((mir_value_t){ .tag = MIR_TAG_NULL })

typedef union {
   struct {
      unsigned tag : _MIR_TAG_BITS;
      unsigned id : _MIR_ID_BITS;
   };
   uint32_t bits;
} mir_type_t;

STATIC_ASSERT(sizeof(mir_type_t) == 4);

#define MIR_NULL_TYPE ((mir_type_t){ .tag = MIR_TAG_NULL })

typedef union {
   struct {
      unsigned tag : _MIR_TAG_BITS;
      unsigned id : _MIR_ID_BITS;
   };
   uint32_t bits;
} mir_stamp_t;

STATIC_ASSERT(sizeof(mir_stamp_t) == 4);

#define MIR_NULL_STAMP ((mir_stamp_t){ .tag = MIR_TAG_NULL })

#define mir_is_null(o) ((o).tag == MIR_TAG_NULL)
#define mir_equals(a, b) ((a).bits == (b).bits)

#define mir_cast_value(p) ((mir_value_t){ .bits = (p).bits })

#define mir_cast_block(p) ({                    \
         assert((p).tag == MIR_TAG_BLOCK);      \
         (mir_block_t){ .bits = (p).bits };     \
      })

#define mir_cast_type(p) ({                     \
         assert((p).tag == MIR_TAG_TYPE);       \
         (mir_type_t){ .bits = (p).bits };      \
      })

typedef struct {
   uint16_t first;
   uint16_t width;
} mir_vreg_t;

STATIC_ASSERT(sizeof(mir_vreg_t) == 4);

#define MIR_VREG_MAX UINT16_MAX

typedef enum {
   MIR_CMP_EQ,
   MIR_CMP_NEQ,
   MIR_CMP_LT,
   MIR_CMP_GT,
   MIR_CMP_LEQ,
   MIR_CMP_GEQ,
} mir_cmp_t;

typedef enum {
   _MIR_DELETED_OP,
   MIR_OP_ADD,
   MIR_OP_RETURN,
   MIR_OP_COMMENT,
   MIR_OP_CONST,
   MIR_OP_STORE,
   MIR_OP_LOAD,
   MIR_OP_CONST_REAL,
   MIR_OP_JUMP,
   MIR_OP_COND,
   MIR_OP_CMP,
   MIR_OP_PHI,
   MIR_OP_AND,
   MIR_OP_SUB,
   MIR_OP_MUL,
   MIR_OP_DIV,
   MIR_OP_REM,
   MIR_OP_MOD,
   MIR_OP_EXP,
   MIR_OP_OR,
   MIR_OP_XOR,
   MIR_OP_CONSUME,
   MIR_OP_FCALL,
   MIR_OP_PCALL,
   MIR_OP_RESUME,
   MIR_OP_WRAP,
   MIR_OP_UNWRAP,
   MIR_OP_NOT,
   MIR_OP_RESOLVED,
   MIR_OP_LAST_VALUE,
   MIR_OP_LOCUS,
   MIR_OP_INIT_SIGNAL,
   MIR_OP_IMPLICIT_SIGNAL,
   MIR_OP_SELECT,
   MIR_OP_WAIT,
   MIR_OP_LINK_PACKAGE,
   MIR_OP_PACKAGE_INIT,
   MIR_OP_PROTECTED_INIT,
   MIR_OP_ASSERT,
   MIR_OP_CONTEXT_UPREF,
   MIR_OP_UARRAY_LEN,
   MIR_OP_UARRAY_LEFT,
   MIR_OP_UARRAY_RIGHT,
